Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/mosko-n.html.tmx
Source language: nob
Languages: sme

source: Finnefondet er omtalt i en rekke artikler i Samisk skolehistorie, særlig grundig av Henry Minde i bind 1.
sme: Sámefoandda birra lea muitaluvvon moanain artihkkaliin Sámi skuvlahistorjjás, erenoamáš dárkilit lea Henry Minde muitalan vuosttaš girjjis.

source: [3] Kilde: Skoledirektørens arkiv, Troms, nr. 258.
sme: [3] Gáldu: Romsa skuvladirektevrra arkiiva, no. 258.

source: Sitert etter Tove Johansen: Forholdet mellom politikk og religion i et sjøsamisk område fra 1920–1970.
sme: Tove Johansena bájuheami mielde: Eará artihkkalat Sámi skuvlahistorjá 6-girjjis
